import { AbuDabi } from "./cities/AbuDabi"
import { Abuja } from "./cities/Abuja"
import { Accra } from "./cities/Accra"
import { Algiers } from "./cities/Algiers"
import { Amsterdam } from "./cities/Amsterdam"
import { Amman } from "./cities/Amman"

import { City } from "./cityType"


export const factorQuestionName = {
  structures: {
    health_safety: [
      "Базові санітарні умови відповідають потребам найбідніших районів",
      "Послуги з утилізації задовільні",
      "Громадська безпека не є проблемою",
      "Забруднення повітря не є проблемою",
      "Надання медичних послуг задовільний",
      "Знайти житло з орендною платою в розмірі 30% або менше місячної зарплати не проблема",
    ],
    mobility: [
      "Затори не є проблемою",
      "Громадський транспорт задовільний",
    ],
    activities: [
      "Зелені насадження задовільні",
      "Культурна діяльність (шоу, бари, музеї) задовільна",
    ],
    opportunities: [
      "Послуги з пошуку роботи доступні",
      "Більшість дітей мають доступ до хорошої школи",
      "Можливості навчання впродовж життя надають місцеві установи",
      "Підприємства створюють нові робочі місця",
      "Меншини відчувають себе бажаними",
    ],
    governance: [
      "Інформація про рішення місцевої влади є легкодоступною",
      "Корупція міської влади не викликає занепокоєння",
      "Мешканці беруть участь у прийнятті рішень місцевої влади",
      "Мешканці надають відгуки про проекти місцевого самоврядування",
    ],
  },
  technologies: {
    health_safety: [
      "Онлайн-повідомлення про проблеми з утриманням міста забезпечує швидке вирішення",
      "Веб-сайт або додаток дозволяє мешканцям легко віддавати непотрібні речі",
      "Безкоштовний громадський Wi-Fi покращив доступ до міських послуг",
      "Камери відеоспостереження змусили жителів почуватися безпечніше",
      "Веб-сайт або додаток дозволяє мешканцям ефективно контролювати забруднення повітря",
      "Запис на прийом до лікаря онлайн покращив доступ",
    ],
    mobility: [
      "Програми для спільного використання автомобілів зменшили затори",
      "Програми, які спрямовують вас до вільного паркувального місця, скорочують час у дорозі",
      "Прокат велосипедів зменшив затори",
      "Онлайн-розклад і продаж квитків спростили користування громадським транспортом",
      "Місто надає інформацію про затори через мобільні телефони",
    ],
    activities: [
      "Онлайн-купівля квитків на вистави та музеї полегшила відвідування",
    ],
    opportunities: [
      "Онлайн-доступ до списків вакансій полегшив пошук роботи",
      "ІТ-навички добре навчають у школах",
      "Онлайн-сервіси, які надає місто, полегшили відкриття нового бізнесу",
      "Поточна швидкість і надійність Інтернету відповідають потребам підключення",
    ],
    governance: [
      "Онлайн-доступ громадян до міських фінансів зменшив корупцію",
      "Інтернет-голосування збільшило кількість учасників",
      "Онлайн-платформа, де мешканці можуть пропонувати ідеї, покращила життя міста",
      "Обробка ідентифікаційних документів онлайн скоротила час очікування",
    ],
  },
}

export const smartCities: { [key: string]: City } = {
  AbuDabi,
  Abuja,
  Accra,
  Algiers,
  Amman,
  Amsterdam,
}